---------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/anushreedeb/Desktop/MGPS/Data Management/Assignments/Final Paper/Data/DHS India 2015-
> 16/DHS_Birth Recode/birth_recode.log
  log type:  text
 opened on:  16 Apr 2019, 23:16:40

. 
. gen age = v008 - b3

. 
. gen child_age=.
(1,315,617 missing values generated)

. replace child_age = age if child_age==. & b7==.
(1,222,366 real changes made)

. 
. gen infant_mor=0 if child_age > =12 & child_age!=.
(141,546 missing values generated)

. replace infant_mor = 1000 if b7 <12 & b7!=.
(66,158 real changes made)

. replace infant_mor = 0 if b7 > = 12 & b7! =.
(27,093 real changes made)

. 
. gen child_mor=0 if child_age > = 60 & child_age!=.
(340,994 missing values generated)

. replace child_mor = 1000 if b7 <60 & b7!=.
(82,338 real changes made)

. replace child_mor = 0 if b7 > = 60 & b7! =.
(10,913 real changes made)

. 
. tab infant_mor,m

 infant_mor |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,201,164       91.30       91.30
       1000 |     66,158        5.03       96.33
          . |     48,295        3.67      100.00
------------+-----------------------------------
      Total |  1,315,617      100.00

. tab child_mor,m

  child_mor |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    985,536       74.91       74.91
       1000 |     82,338        6.26       81.17
          . |    247,743       18.83      100.00
------------+-----------------------------------
      Total |  1,315,617      100.00

. 
. pca v744a v744b v744c v744d v744e s936f s936g

Principal components/correlation                 Number of obs    =    228,319
                                                 Number of comp.  =          7
                                                 Trace            =          7
    Rotation: (unrotated = principal)            Rho              =     1.0000

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |       3.3854       2.5582             0.4836       0.4836
           Comp2 |      .827199      .092416             0.1182       0.6018
           Comp3 |      .734783      .160072             0.1050       0.7068
           Comp4 |      .574711     .0285354             0.0821       0.7889
           Comp5 |      .546176     .0437642             0.0780       0.8669
           Comp6 |      .502412     .0730909             0.0718       0.9387
           Comp7 |      .429321            .             0.0613       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5     Comp6     Comp7 | Unexplained 
    -------------+----------------------------------------------------------------------+-------------
           v744a |   0.3564   -0.5898   -0.1764    0.5070    0.2915    0.0062    0.3898 |           0 
           v744b |   0.4088   -0.3820   -0.2000   -0.1030   -0.1874    0.0942   -0.7696 |           0 
           v744c |   0.3954   -0.2197    0.1083   -0.7254   -0.0840   -0.3404    0.3668 |           0 
           v744d |   0.3427    0.0837    0.8115    0.0392    0.3202    0.3158   -0.1149 |           0 
           v744e |   0.3901    0.2473    0.1520    0.3765   -0.7649   -0.0888    0.1700 |           0 
           s936f |   0.3749    0.4905   -0.1793    0.1599    0.4185   -0.5905   -0.1932 |           0 
           s936g |   0.3733    0.3863   -0.4509   -0.1929    0.1009    0.6473    0.2042 |           0 
    --------------------------------------------------------------------------------------------------

. predict domestic_violence_index
(score assumed)
(6 components skipped)

Scoring coefficients 
    sum of squares(column-loading) = 1

    ------------------------------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5     Comp6     Comp7 
    -------------+----------------------------------------------------------------------
           v744a |   0.3564   -0.5898   -0.1764    0.5070    0.2915    0.0062    0.3898 
           v744b |   0.4088   -0.3820   -0.2000   -0.1030   -0.1874    0.0942   -0.7696 
           v744c |   0.3954   -0.2197    0.1083   -0.7254   -0.0840   -0.3404    0.3668 
           v744d |   0.3427    0.0837    0.8115    0.0392    0.3202    0.3158   -0.1149 
           v744e |   0.3901    0.2473    0.1520    0.3765   -0.7649   -0.0888    0.1700 
           s936f |   0.3749    0.4905   -0.1793    0.1599    0.4185   -0.5905   -0.1932 
           s936g |   0.3733    0.3863   -0.4509   -0.1929    0.1009    0.6473    0.2042 
    ------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/anushreedeb/Desktop/MGPS/Data Management/Assignments/Final Paper/Data/DHS India 2015-
> 16/DHS_Birth Recode/birth_recode.log
  log type:  text
 closed on:  16 Apr 2019, 23:16:52
---------------------------------------------------------------------------------------------------------
